# CannotMirrorWallPanel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotMirrorWallPanel Property
BuiltInFailures..::..WallFailures Class See Also
---
Cannot mirror wall panels.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMirrorWallPanel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMirrorWallPanel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMirrorWallPanel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace